zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/startup_MIMXRT758S_cm33_core0.c
WEAK void CTIMER3_IRQHandler(void)
{
    CTIMER3_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM0_IRQHandler(void)
{
    LP_FLEXCOMM0_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM1_IRQHandler(void)
{
    LP_FLEXCOMM1_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM2_IRQHandler(void)
{
    LP_FLEXCOMM2_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM3_IRQHandler(void)
{
    LP_FLEXCOMM3_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM4_IRQHandler(void)
{
    LP_FLEXCOMM4_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM5_IRQHandler(void)
{
    LP_FLEXCOMM5_DriverIRQHandler();
}

WEAK void LPSPI14_IRQHandler(void)
{
    LPSPI14_DriverIRQHandler();
}

WEAK void LPI2C15_IRQHandler(void)
{
    LPI2C15_DriverIRQHandler();
}

WEAK void ADC_IRQHandler(void)
{
    ADC_DriverIRQHandler();
}

WEAK void SDADC_IRQHandler(void)
{
    SDADC_DriverIRQHandler();
}

WEAK void ACMP_IRQHandler(void)
{
    ACMP_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{
    PDM_EVENT_DriverIRQHandler();
}

WEAK void PDM_HWVAD_EVENT_IRQHandler(void)
{
    PDM_HWVAD_EVENT_DriverIRQHandler();
}

WEAK void HYPERVISOR_IRQHandler(void)
{
    HYPERVISOR_DriverIRQHandler();
}

WEAK void SECURE_VIOLATION_IRQHandler(void)
{
    SECURE_VIOLATION_DriverIRQHandler();
}

WEAK void SENSE_HYPERVISOR_IRQHandler(void)
{
    SENSE_HYPERVISOR_DriverIRQHandler();
}

WEAK void SENSE_SECURE_VIOLATION_IRQHandler(void)
{
    SENSE_SECURE_VIOLATION_DriverIRQHandler();
}

WEAK void MEDIA_HYPERVISOR_IRQHandler(void)
{
    MEDIA_HYPERVISOR_DriverIRQHandler();
}

WEAK void MEDIA_SECURE_VIOLATION_IRQHandler(void)
{
    MEDIA_SECURE_VIOLATION_DriverIRQHandler();
}

WEAK void RTC0_ALARM_IRQHandler(void)
{
    RTC0_ALARM_DriverIRQHandler();
}

WEAK void RTC0_IRQHandler(void)
{
    RTC0_DriverIRQHandler();
}

WEAK void Reserved44_IRQHandler(void)
{
    Reserved44_DriverIRQHandler();
}

WEAK void MU0_A_IRQHandler(void)
{
    MU0_A_DriverIRQHandler();
}

WEAK void MU1_A_IRQHandler(void)
{
    MU1_A_DriverIRQHandler();
}

WEAK void Reserved47_IRQHandler(void)
{
    Reserved47_DriverIRQHandler();
}

WEAK void CTIMER2_IRQHandler(void)
{
    CTIMER2_DriverIRQHandler();
}

WEAK void CTIMER4_IRQHandler(void)
{
    CTIMER4_DriverIRQHandler();
}

WEAK void OS_EVENT_IRQHandler(void)
{
    OS_EVENT_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM6_IRQHandler(void)
{
    LP_FLEXCOMM6_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM7_IRQHandler(void)
{
    LP_FLEXCOMM7_DriverIRQHandler();
}

WEAK void USDHC0_IRQHandler(void)
{
    USDHC0_DriverIRQHandler();
}

WEAK void USDHC1_IRQHandler(void)
{
    USDHC1_DriverIRQHandler();
}

WEAK void I3C0_IRQHandler(void)
{
    I3C0_DriverIRQHandler();
}

WEAK void USB0_IRQHandler(void)
{
    USB0_DriverIRQHandler();
}

WEAK void USB1_IRQHandler(void)
{
    USB1_DriverIRQHandler();
}

WEAK void WDT0_IRQHandler(void)
{
    WDT0_DriverIRQHandler();
}

WEAK void WDT1_IRQHandler(void)
{
    WDT1_DriverIRQHandler();
}

WEAK void USBPHY0_IRQHandler(void)
{
    USBPHY0_DriverIRQHandler();
}

WEAK void PUF_IRQHandler(void)
{
    PUF_DriverIRQHandler();
}

WEAK void Reserved62_IRQHandler(void)
{
    Reserved62_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM8_IRQHandler(void)
{
    LP_FLEXCOMM8_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM9_IRQHandler(void)
{
    LP_FLEXCOMM9_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM10_IRQHandler(void)
{
    LP_FLEXCOMM10_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM11_IRQHandler(void)
{
    LP_FLEXCOMM11_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM12_IRQHandler(void)
{
    LP_FLEXCOMM12_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM13_IRQHandler(void)
{
    LP_FLEXCOMM13_DriverIRQHandler();
}

WEAK void LPSPI16_IRQHandler(void)
{
    LPSPI16_DriverIRQHandler();
}

WEAK void I3C1_IRQHandler(void)
{
    I3C1_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{
    FLEXIO_DriverIRQHandler();
}

WEAK void LCDIF_IRQHandler(void)
{
    LCDIF_DriverIRQHandler();
}

WEAK void VGPU_IRQHandler(void)
{
    VGPU_DriverIRQHandler();
}

WEAK void MIPI_IRQHandler(void)
{
    MIPI_DriverIRQHandler();
}

WEAK void EDMA0_CH0_IRQHandler(void)
{
    EDMA0_CH0_DriverIRQHandler();
}

WEAK void EDMA0_CH1_IRQHandler(void)
{
    EDMA0_CH1_DriverIRQHandler();
}

WEAK void EDMA0_CH2_IRQHandler(void)
{
    EDMA0_CH2_DriverIRQHandler();
}

WEAK void EDMA0_CH3_IRQHandler(void)
{
    EDMA0_CH3_DriverIRQHandler();
}

WEAK void EDMA0_CH4_IRQHandler(void)
{
    EDMA0_CH4_DriverIRQHandler();
}

WEAK void EDMA0_CH5_IRQHandler(void)
{
    EDMA0_CH5_DriverIRQHandler();
}

WEAK void EDMA0_CH6_IRQHandler(void)
{
    EDMA0_CH6_DriverIRQHandler();
}

WEAK void EDMA0_CH7_IRQHandler(void)
{
    EDMA0_CH7_DriverIRQHandler();
}

WEAK void EDMA0_CH8_IRQHandler(void)
{
    EDMA0_CH8_DriverIRQHandler();
}

WEAK void EDMA0_CH9_IRQHandler(void)
{
    EDMA0_CH9_DriverIRQHandler();
}

WEAK void EDMA0_CH10_IRQHandler(void)
{
    EDMA0_CH10_DriverIRQHandler();
}

WEAK void EDMA0_CH11_IRQHandler(void)
{
    EDMA0_CH11_DriverIRQHandler();
}

WEAK void EDMA0_CH12_IRQHandler(void)
{
    EDMA0_CH12_DriverIRQHandler();
}

WEAK void EDMA0_CH13_IRQHandler(void)
{
    EDMA0_CH13_DriverIRQHandler();
}

WEAK void EDMA0_CH14_IRQHandler(void)
{
    EDMA0_CH14_DriverIRQHandler();
}

WEAK void EDMA0_CH15_IRQHandler(void)
{
    EDMA0_CH15_DriverIRQHandler();
}

WEAK void EDMA1_CH0_IRQHandler(void)
{
    EDMA1_CH0_DriverIRQHandler();
}

WEAK void EDMA1_CH1_IRQHandler(void)
{
    EDMA1_CH1_DriverIRQHandler();
}

WEAK void EDMA1_CH2_IRQHandler(void)
{
    EDMA1_CH2_DriverIRQHandler();
}

WEAK void EDMA1_CH3_IRQHandler(void)
{
    EDMA1_CH3_DriverIRQHandler();
}

WEAK void EDMA1_CH4_IRQHandler(void)
{
    EDMA1_CH4_DriverIRQHandler();
}

WEAK void EDMA1_CH5_IRQHandler(void)
{
    EDMA1_CH5_DriverIRQHandler();
}

WEAK void EDMA1_CH6_IRQHandler(void)
{
    EDMA1_CH6_DriverIRQHandler();
}

WEAK void EDMA1_CH7_IRQHandler(void)
{
    EDMA1_CH7_DriverIRQHandler();
}

WEAK void EDMA1_CH8_IRQHandler(void)
{
    EDMA1_CH8_DriverIRQHandler();
}

WEAK void EDMA1_CH9_IRQHandler(void)
{
    EDMA1_CH9_DriverIRQHandler();
}

WEAK void EDMA1_CH10_IRQHandler(void)
{
    EDMA1_CH10_DriverIRQHandler();
}

WEAK void EDMA1_CH11_IRQHandler(void)
{
    EDMA1_CH11_DriverIRQHandler();
}

